# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
  
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2      
   [-1, 1, Conv, [64, 3, 1]], #2 (P1 backbone)
   
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4  
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 11 (P2 backbone)
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 16-P3/8  
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 24 (P3 backbone)
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 29-P4/16  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 37 (P4 backbone)
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [512, 1, 1]],
   [-3, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 42-P5/32  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 50
  ]

# 2 (P1 backbone)
# 11 (P2 backbone)
# 24 (P3 backbone)
# 37 (P4 backbone)
# 50 (P5 backbone)


# yolov7 head
head:
  [
   # bifusion module 1
   [50, 1, SPPCSPC, [640]],  # 51
   #    RB block1, route backbone P5+P4+P6
   #    output/current/shallow/deep layer depth 480/384/192/384
   #    upsample scale factor 2, mode nearest
   [-1, 1, Conv, [384, 1, 1]], # 52
   [[37, 24, -1], 1, RBBlockA, [480, '384,1,1;192,1,2', 2, 'nearest']],  # 53
   [-1, 1, Bottleneck, [384, False]],
   [-1, 2, BottleneckCSPB, [384]],
   [-1, 1, InceptionBlockA, [384]],
   [-1, 1, Bottleneck, [192, False]],  
   [-1, 2, BottleneckCSPB, [192]], # 58
   
   #    RB block2, route backbone P4+P3+RB Block1
   #    output/current/shallow/deep layer depth 320/256/128/256
   #    upsample scale factor 2, mode nearest
   [-1, 1, Conv, [256, 1, 1]], # 59
   [[24, 11, -1], 1, RBBlockA, [320, '256,1,1;128,1,2', 2, 'nearest']],  # 60
   [-1, 1, Bottleneck, [256, False]],
   [-1, 2, BottleneckCSPB, [256]],
   [-1, 1, InceptionBlockA, [256]],
   [-1, 1, Bottleneck, [128, False]],
   [-1, 2, BottleneckCSPB, [128]],  # 65

   #    RB block3, route backbone P3+P2+RB Block2
   #    output/current/shallow/deep layer depth 160/128/64/128
   #    upsample scale factor 2, mode nearest
   [-1, 1, Conv, [128, 1, 1]], # 66
   [[11, 2, -1], 1, RBBlockA, [160, '128,1,1;64,1,2', 2, 'nearest']],  # 67
   [-1, 1, Bottleneck, [128, False]],
   [-1, 2, BottleneckCSPB, [128]],
   [-1, 1, InceptionBlockA, [128]],
   [-1, 1, Bottleneck, [64, False]],
   [-1, 2, BottleneckCSPB, [64]],  # 72
   
   #    BFM1
   [[-1,66], 1, BFM, [128, '64,1,1;64,1,1']], 
   [-1, 1, Bottleneck, [128, False]],
   [-1, 2, BottleneckCSPB, [64]],  # 75

   #    BFM2
   [[-1,59], 1, BFM, [256, '128,1,1;128,1,1']], 
   [-1, 1, Bottleneck, [256, False]],
   [-1, 2, BottleneckCSPB, [128]],  # 78

   #    BFM3
   [[-1,52], 1, BFM, [512, '256,1,1;256,1,1']], 
   [-1, 1, Bottleneck, [512, False]],
   [-1, 2, BottleneckCSPB, [256]],  # 81
   # end of bifusion module 1
   
   
   #Lead Head
   [72, 1, Conv, [320, 1, 1]],
   [75, 1, Conv, [640, 1, 1]],
   [78, 1, Conv, [960, 1, 1]],   
   [81, 1, Conv, [1280, 1, 1]],

   #Iux Head
   [72, 1, Conv, [320, 1, 1]],
   [65, 1, Conv, [640, 1, 1]],
   [58, 1, Conv, [960, 1, 1]],   
   [52, 1, Conv, [1280, 1, 1]],

   [[82, 83, 84, 85, 86, 87, 88, 89], 1, IAuxDetect, [nc, anchors]],   # Detect(P3, P4, P5, P6)
  ]
