# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# CSP-Darknet backbone
backbone:
  # [from, number, module, args]
  # assume image size 640 640
  [[-1, 1, Conv, [32, 3, 1]],  # 0          # 32   x 640 x 640
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2     # 64   x 320 x 320
   [-1, 1, Bottleneck, [64]],               # 64   x 320 x 320
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4    # 128  x 160 x 160
   [-1, 2, BottleneckCSPC, [128]],          # 128  x 160 x 160
   [-1, 1, Conv, [256, 3, 2]],  # 5-P3/8    # 256  x 80  x 80
   [-1, 8, BottleneckCSPC, [256]],          # 256  x 80  x 80
   [-1, 1, Conv, [512, 3, 2]],  # 7-P4/16   # 512  x 40  x 40
   [-1, 8, BottleneckCSPC, [512]],          # 512  x 40  x 40
   [-1, 1, Conv, [1024, 3, 2]], # 9-P5/32   # 1024 x 20  x 20
   [-1, 4, BottleneckCSPC, [1024]],  # 10   # 1024 x 20  x 20
  ]

# CSP-Dark-PAN head feat PRB neck
head:
  [
   # bifusion module 1 start
   [10, 1, SPPCSPC, [512]], #11
   #    RB block1, route backbone P4+P3+P5
   #    output/current/shallow/deep layer depth 512/256/128/256
   #    upsample scale factor 2, mode nearest
   [-1, 1, Conv, [256, 1, 1]],
   [[8, 6, -1], 1, RBBlockA, [512, '256,1,1;128,1,2', 2, 'nearest']], #13
   [-1, 2, Bottleneck, [512, False]], 
   [-1, 2, BottleneckCSPB, [256]], #15
   #    RB block2, route backbone P3+P2+RB Block1
   #    output/current/shallow/deep layer depth 256/128/64/128
   #    upsample scale factor 2, mode nearest
   [-1, 1, Conv, [128, 1, 1]],
   [[6, 4, -1], 1, RBBlockA, [256, '128,1,1;64,1,2', 2, 'nearest']], #17
   [-1, 2, Bottleneck, [256, False]], #18
   # Bifusion module 1 end
   
   
   # bifusion module 2 start
   [8, 1, SPPCSPC, [256]], #19
   #    RBblock1, route backbone P3+P2+P4
   #    output/current/shallow/deep layer depth 512/128/64/128
   #    upsample scale factor 2, mode nearest
   [-1, 1, Conv, [128, 1, 2]],
   [[6, 4, -1], 1, RBBlockA, [512, '128,1,2;64,1,4', 2, 'nearest']], #21
   [-1, 2, Bottleneck, [512, False]], 
   [-1, 2, BottleneckCSPB, [256]], #23
   #    RB block2, route backbone P2+P1+RB Block1
   #    output/current/shallow/deep layer depth 256/64/32/128
   #    upsample scale factor 2, mode nearest
   [-1, 1, Conv, [128, 1, 1]],
   [[4, 2, -1], 1, RBBlockA, [256, '64,1,2;32,1,4', 2, 'nearest']], #25
   [-1, 2, Bottleneck, [256, False]], #26
   # Bifusion module 2 end
   
  
   # bifusion module 3 start
   [6, 1, SPPCSPC, [128]], #27
   #    RBblock1, route backbone P2+P1+P3
   #    output/current/shallow/deep layer depth 512/64/32/64
   #    upsample scale factor 2, mode nearest
   [-1, 1, Conv, [64, 1, 4]],
   [[4, 2, -1], 1, RBBlockA, [512, '64,1,4;32,1,8', 2, 'nearest']], #29   
   [-1, 2, Bottleneck, [512, False]], 
   [-1, 2, BottleneckCSPB, [256]], #31
   #    RB block2, route backbone P1+P0+RB Block1
   #    output/current/shallow/deep layer depth 256/32/32/128
   #    upsample scale factor 2, mode nearest
   [-1, 1, Conv, [128, 1, 1]],
   [[2, 1, -1], 1, RBBlockA, [256, '32,1,4;32,1,4', 2, 'nearest']], #33
   [-1, 2, Bottleneck, [256, False]], #34
   # Bifusion module 3 end
   
   
   [[-1, 26, 18], 1, Concat, [1]], #35 multi-pyramid fusion PY3/8
   [-1, 4, BottleneckCSPB, [128]], #36 bottleneck = PY + 1
   [-1, 1, Conv, [256, 3, 1]],
   [[32, 24 ,16], 1, Concat, [1]],  #38 multi-pyramid fusion PY4/16
   [-1, 4, BottleneckCSPB, [256]], #39 bottleneck = PY + 1
   [-1, 1, Conv, [512, 3, 1]],
   [[28, 20 ,12], 1, Concat, [1]],  #41 multi-pyramid fusion PY5/32
   [-1, 4, BottleneckCSPB, [512]], #42 bottleneck = PY + 1
   [-1, 1, Conv, [1024, 3, 1]],

   [[43,40,37], 1, Detect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
