# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
  
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2      
   [-1, 1, Conv, [64, 3, 1]], #2 (P1 backbone)
   
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4  
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 11 (P2 backbone)
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 16-P3/8  
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 24 (P3 backbone)
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 29-P4/16  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 37 (P4 backbone)
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [512, 1, 1]],
   [-3, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 42-P5/32  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 50
  ]

# 2 (P1 backbone)
# 11 (P2 backbone)
# 24 (P3 backbone)
# 37 (P4 backbone)
# 50 (P5 backbone)


# yolov7 head
head:
  [[24, 1, SPPCSPC, [128]], # 51 bifusion module 3 start
   [37, 1, SPPCSPC, [256]], # 52 bifusion module 2 start
   [50, 1, SPPCSPC, [512]], # 53 bifusion module 1 start
   [-1, 1, Conv, [256, 1, 1]], # 54 route PRB_1
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # RB block1 start # 55
   [24, 1, Conv, [128, 1, 2]], # route backbone P3
   [37, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2, -3], 1, Concat, [1]], # RB block1 end # 58
   [-1, 1, Conv, [512, 1, 1]], 
   [-1, 2, Bottleneck, [512, False]],
   [-1, 2, BottleneckCSPB, [256]], # 61
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # RB block2 start #63
   [11, 1, Conv, [64, 1, 2]],  # route backbone P2
   [24, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2, -3], 1, Concat, [1]], # RB block2 end #66
   [-1, 1, Conv, [256, 1, 1]], 
   [-1, 2, Bottleneck, [256, False]], # 68 bifusion module 1 end
   [52, 1, Conv, [128, 1, 2]], #69 route PRB_2
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # RB block1 start # 70
   [11, 1, Conv, [64, 1, 4]],  # route backbone P2
   [24, 1, Conv, [128, 1, 2]], # route backbone P3
   [[-1, -2, -3], 1, Concat, [1]], # RB block1 end # 73
   [-1, 1, Conv, [512, 1, 1]], 
   [-1, 2, Bottleneck, [512, False]], 
   [-1, 2, BottleneckCSPB, [256]], # 76
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # RB block2 start #78
   [2, 1, Conv, [32, 1, 4]],  # route backbone P1
   [11, 1, Conv, [64, 1, 2]], # route backbone P2
   [[-1, -2, -3], 1, Concat, [1]], # RB block2 end #81
   [-1, 1, Conv, [256, 1, 1]], 
   [-1, 2, Bottleneck, [256, False]], # 83 bifusion module 2 end
   [51, 1, Conv, [64, 1, 4]], #84 route PRB_3
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # RB block1 start # 85
   [2, 1, Conv, [32, 1, 8]],  # route backbone P1
   [11, 1, Conv, [64, 1, 4]], # route backbone P2
   [[-1, -2, -3], 1, Concat, [1]], # RB block1 end # 88
   [-1, 1, Conv, [512, 1, 1]], 
   [-1, 2, Bottleneck, [512, False]], 
   [-1, 2, BottleneckCSPB, [256]], # 91
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # RB block2 start #93
   [1, 1, Conv, [32, 1, 4]],  # route backbone P0-1
   [2, 1, Conv, [32, 1, 4]], # route backbone P1
   [[-1, -2, -3], 1, Concat, [1]], # RB block2 end #96
   [-1, 1, Conv, [256, 1, 1]], 
   [-1, 2, Bottleneck, [256, False]], # 98 bifusion module 3 end
   [[-1,83, 68], 1, Concat, [1]], # 99 multi-pyramid fusion PY3/8
   [-1, 4, BottleneckCSPB, [128]], #100 bottleneck = PY + 1
   [-1, 1, Conv, [256, 3, 1]],
   [[91, 76 ,61], 1, Concat, [1]],  #102 multi-pyramid fusion PY4/16
   [-1, 4, BottleneckCSPB, [256]], #103 bottleneck = PY + 1
   [-1, 1, Conv, [512, 3, 1]],
   [[84, 69 ,54], 1, Concat, [1]],  #105 multi-pyramid fusion PY5/32
   [-1, 4, BottleneckCSPB, [512]], #106 bottleneck = PY + 1
   [-1, 1, Conv, [1024, 3, 1]],
   
   [101, 1, RepConv, [256, 3, 1]],
   [104, 1, RepConv, [512, 3, 1]],
   [107, 1, RepConv, [1024, 3, 1]],

   [[108,109,110], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
